Repository: progit/progit
Catalog: es/omegat-Benzirpi.tmx
Source language: en
Languages: es

source: Probably the simplest way for smaller setups is to run a static web server with its document root where your Git repositories are, and then enable that `post-update` hook we mentioned in the first section of this chapter.
es: La manera más sencilla de hacerlo para pequeños despliegues, es el preparar un servidor web estático cuya raiz de documentos sea la ubicación donde tengas tus repositorios Git; y luego activar el anclaje (hook) 'post-update' que se ha mencionado en la primera parte de este capítulo.

source: ## The Protocols ##
es: ## Los Protocolos ##

source: We’ll refer to this repository as a "Git server"; but you’ll notice that it generally takes a tiny amount of resources to host a Git repository, so you’ll rarely need to use an entire server for it.
es: Nos referiremos a este repositorio como "servidor Git"; pero en seguida te darás cuenta de que solo se necesitan unos pocos recursos para albergar un repositorio Git, y, por tanto, no será necesario utilizar todo un servidor entero para él.

source: The question now is, when you run `git branch (branchname)`, how does Git know the SHA-1 of the last commit?
es: Y ahora nos preguntamos, al lanzar el comando `git branch (nombrederama)`, ¿cómo sabe Git cuál es el valor SHA-1 de la última confirmación de cambios?.

source: The simplest setup you’re likely to encounter is a private project with one or two other developers.
es: Lo más simple que te puedes encontrar es un proyecto privado con uno o dos desarrolladores.

source: In fact, if you have a script that will exit 0 if the project is good or non-0 if the project is bad, you can fully automate `git bisect`.
es: De hecho, si se dispone de un script que dé una salida 0 si el proyecto funciona correctamente y distinto de 0 si el proyecto tiene errores, todo este proceso de búsqueda con `git bisect` se puede automatizar completamente.

source: This is particularly useful for managing your branches — if you have a lot of branches, you can use range specifications to answer questions such as, "What work is on this branch that I haven’t yet merged into my main branch?"
es: Esto es especialmente útil en la gestión de ramas. Si se tienen multitud de ramas, se pueden emplear las espeficicaciones de rango para responder a cuestiones tales como "¿cual es el trabajo de esta rama que aún no se ha fusionado con la rama principal?".

source: This can also be written `HEAD^^^`, which again is the first parent of the first parent of the first parent:
es: Igualmente, se podría haber escrito `HEAD^^^`, que también se refiere al "primer padre del primer padre del primer padre":

source: If there is a subdirectory or file that you don’t want to include in your archive file but that you do want checked into your project, you can determine those files via the `export-ignore` attribute.
es: Cuando tienes alguna carpeta o archivo que no deseas incluir en tus registros, pero quieras tener controlado en tu proyecto, puedes marcarlos a través del atributo 'export-ignore'.

source: John has to fetch Jessica’s changes and merge them in before he will be allowed to push:
es: John se vé obligado a recuperar (fetch) los cambios de jessica y a fusionarlos (merge) con los suyos, antes de que se le permita enviar (push):

source: You can run your tests, make sure the hotfix is what you want, and merge it back into your master branch to deploy to production.
es: Puedes realizar las pruebas oportunas, asegurarte que la solución es correcta, e incorporar los cambios a la rama 'master' para ponerlos en producción.

source: Because it’s rarely used, we won’t cover it in this book.
es: Y precisamente porque se usa raramente, no lo vamos a cubrir en este libro.

source: This allows you to introduce all the changes from another branch and then make more changes before recording the new commit.
es: Esto te permitirá el aplicar todos los cambios de la otra rama y después hacer más cambios, antes de guardarlos todos ellos en una nueva confirmación (commit).

source: You can use this hook to disallow rebasing any commits that have already been pushed.
es: Puedes usarlo para impedir reorganizaciones de cualquier confirmación de cambios ya enviada (push) a algún servidor.

source: Finally, John’s commit history looks like Figure 5-6.
es: Finalmente, el historial de John es algo parecido a la Figura 5-6.

source: If you have it read the message from the file passed as the first argument and compare that to the pattern, you can force Git to abort the commit if there is no match:
es: Comparando el mensaje del archivo pasado como primer argumento con el mensaje patrón, puedes obligar a Git a abortar la confirmación de cambios (commit) en caso de no coincidir ambos:

source: Notice the `*` character that prefixes the `master` branch: it indicates the branch that you currently have checked out.
es: Fijate en el carácter '*' delante de la rama 'master': nos indica la rama activa en este momento.

source: Now you want to release a build.
es: Si quieres lanzar una nueva versión.

source: Thus these three commands are equivalent:
es: Así, estos tres comandos son equivalentes:

source: Jessica’s history after merging both her topic branches.
es: El historial de Jessica tras fusionar sus dos ramas puntuales.

source: The really interesting part is that the UI for this tool for adding people and determining access isn’t a web interface but a special Git repository.
es: Lo interesante de la interfaz de usuario para esta herramienta de gestión de usuarios y de control de accesos, es que, en lugar de un interface web, es un repositorio especial de Git.

source: Git compresses the contents of these files with zlib, and you’re not storing much, so all these files collectively take up only 925 bytes.
es: Git comprime todos esos archivos con zlib, por lo que ocupan más bien poco. Entre todos suponen solamente 925 bytes.

source: By private, I mean closed source — not read-accessible to the outside world.
es: Por privado, me refiero a código propietario --no disponible para ser leido por el mundo exterior--.

source: You can use it to restore data in the working tree that Git can’t track, such as permissions data.
es: Puedes utilizarlo para recuperar datos de tu carpeta de trabajo que Git no puede controlar, como por ejemplo datos relativos a permisos.

source: ### Putting the Bare Repository on a Server ###
es: ### Poniendo el repositorio básico en un servidor ###

source: A repository on NFS is often slower than the repository over SSH on the same server, allowing Git to run off local disks on each system.
es: Normalmente un repositorio sobre NFS es más lento que un repositorio SSH en el mismo servidor, asumiendo que las pruebas se hacen con Git sobre discos locales en ambos casos.

source: For instance, if you wanted to see what the `master` branch on your `origin` remote looked like as of the last time you communicated with it, you would check the `origin/master` branch.
es: Por ejemplo, si quieres saber cómo estaba la rama 'master' en el remoto 'origin'. Puedes revisar la rama 'origin/master'.

source: Because you rebased the branch, you have to specify the `–f` to your push command in order to be able to replace the `featureA` branch on the server with a commit that isn’t a descendant of it.
es: Debido a que has reorganizado (rebase) tu rama de trabajo, tienes que indicar la opción '-f' en tu comando de envio (push), para permitir que la rama 'featureA' del servidor sea reemplazada por una confirmación de cambios (commit) que no es hija suya.

source: At the very least, this may be a way to get up and running with Git and try it out quickly.
es: Y, por último, comentar que esta puede ser una buena manera de iniciarte y comenzar rápidamente a trabajar con Git.

source: The first line was printed out by you, the other two were Git telling you that the update script exited non-zero and that is what is declining your push.
es: La primera línea la has enviado tú, pero las otras dos son de Git. Indicando que el script de actualización ha terminado con código no-cero y, por tanto, ha rechazado la modificación.

source: You just append them to your `authorized_keys` file:
es: No tienes más que añadirlas al archivo 'authorized_keys':

source: You work for a while, generally in a topic branch, and merge into your master branch when it’s ready to be integrated.
es: Trabajas un rato, normalmente en una rama puntual de un asunto concreto, y la fusionas con tu rama principal cuando la tienes lista para integrar.

source: Most of that should be easy to follow.
es: La mayor parte de este código debería de ser sencillo de leer.

source: Git fires up the `send-pack` process, which initiates a connection over SSH to your server.
es: Git lanzará el proceso `send-pack` , con el que establece conexión SSH con tu servidor.

source: Using smart protocols is a more common method of transferring data.
es: Es mucho más común utilizar protocolos inteligentes para transferir datos.

source: If you follow that guideline, you’ll be fine.
es: Siguiendo esta recomendación, no tendrás problemas.

source: For post-1.6 versions of Git, these example hook files end with .sample; you’ll need to rename them.
es: En las versiones de Git posteriores a la 1.6, esos ejemplos tendrán un nombre acabado en .sample; y tendras que renombrarlos.

source: Insert 18333fig0516.png Figure 5-16.
es: Insert 18333fig0516.png Figura 5-16.

source: If you want to try this out, P4Merge works on all major platforms, so you should be able to do so.
es: Si lo quieres probar, P4Merge funciona en todas las principales plataformas.

source: Finally, Git looks for configuration values in the config file in the Git directory (`.git/config`) of whatever repository you’re currently using.
es: Y por último, Git también puede considerar valores de configuración presentes en el archivo '.git/config' de cada repositorio que estés utilizando.

source: Having work themes isolated into topic branches also makes it easier for you to rebase your work if the tip of the main repository has moved in the meantime and your commits no longer apply cleanly.
es: Manteniendo el trabajo de distintos temas aislados en sus respectivas ramas puntuales, te facilitas también el poder reorganizar tu trabajo si la cabeza del repositorio principal se mueve mientras tanto y tus confirmaciones de cambio (commits) ya no se pueden integrar limpiamente.

source: One of the workarounds to the `denyNonFastForwards` policy is for the user to delete the branch and then push it back up with the new reference.
es: Uno de los cortocircuitos que suelen utilizar los usuarios para saltarse la politica de 'denyNonFastForwards', suele ser el borrar la rama y luego volver a enviarla de vuelta con la nueva referencia.

source: Then, you can push to and pull from that remote as though you were doing so over a network.
es: Con lo que podrás enviar (push) y recibir (pull) desde dicho remoto exactamente de la misma forma a como lo harías a través de una red.

source: To see what changes each commit introduces, remember that you can pass the `-p` option to `git log` and it will append the diff introduced to each commit.
es: Para ver en detalle los cambios introducidos por cada confirmación (commit), recuerda que pasando la opción '-p' al comando 'git log', obtendrás un listado extendido con las diferencias introducidas por cada confirmación.

source: If you want to see what is in `master` or `experiment` but not any common references, you can run
es: Si se desea ver lo que está o bien en 'master' o bien en 'experiment', pero no en ambas simultáneamente, se puede emplear el comando:

source: It looks basically like this:
es: Pues tiene una pinta tal como:

source: You can treat the `rack` directory as a separate project and then update your superproject from time to time with a pointer to the latest commit in that subproject.
es: Se puede considerar la carpeta `rack` como si fuera un proyecto separado. Y, como tal, de vez en cuando se puede actualizar el proyecto padre con un puntero a la última confirmación de cambios en dicho subproyecto.

source: Now, you need to remove this file from all trees in your past.
es: Una vez tengas ese dato, lo puedes utilizar para borrar ese archivo en todos los árboles pasados.

source: It looks like the bottom commit is the one you lost, so you can recover it by creating a new branch at that commit.
es: Parece que la confirmación de cambios perdida es esta última. Puedes recuperarla creando una nueva rama apuntando a ella.

source: You can ask Git to show you a log of just those commits with `master..experiment` — that means "all commits reachable by experiment that aren’t reachable by master." For the sake of brevity and clarity in these examples, I’ll use the letters of the commit objects from the diagram in place of the actual log output in the order that they would display:
es: Se puede pedir a Git que muestre un registro con las confirmaciones de cambio en `master..experiment`. Es decir, "todas las confirmaciones de cambio alcanzables desde experiment que no se pueden alcanzar desde master". Por razones de brevedad y claridad en los ejemplos, para representar los objetos confirmación de cambios (commit) se utilizarán las letras mostradas en el diagrama en lugar de todo el registro propiamente dicho:

source: In this scenario, all work is done in team-based branches and pulled together by the integrators later.
es: En este escenario, todo el trabajo se realiza en ramas propias de cada grupo y es consolidado por los integradores más tarde.

source: If you look at the file, you’ll normally see something like this:
es: Si miras dentro del archivo, podrás observar algo como:

source: Every time you commit, it moves forward automatically.
es: En cada confirmación de cambios que realicemos, la rama irá avanzando automáticamente. Y la rama 'master' apuntará siempre a la última confirmación realizada.

source: You can do that in the `rebase -i` script by changing the instruction on the commit you want to split to "edit":
es: Se puede realizar cambiando la instrucción en el script de `rebase -i`, desde 'split' a 'edit':

source: The format of the refspec is an optional `+`, followed by `<src>:<dst>`, where `<src>` is the pattern for references on the remote side and `<dst>` is where those references will be written locally.
es: El formato para esta referencia es un signo `+` opcional, seguido de una sentencia `<orig>:<dest>`; donde `<orig>` es la plantilla para referencias en el lado remoto y `<dest>` el lugar donde esas referencias se escribirán en el lado local.

source: To initialize a project if it isn’t already a Git project, you use
es: Para inicializar un proyecto, no siendo aún un proyecto Git, sueles utilizar:

source: Commit history after featureBv2 work.
es: Historial tras el trabajo en la versión 2 de la funcionalidad B.

source: Insert 18333fig0321.png Figure 3-21.
es: Insert 18333fig0321.png Figura 3-21.

source: Next is the Git protocol.
es: El protocolo Git

source: Next, you need to add a VirtualHost entry to your Apache configuration with the document root as the root directory of your Git projects.
es: A continuación, has de añadir una entrada VirtualHost al archivo de configuración de Apache, fijando su raiz de documentos a la ubicación donde tengas tus proyectos Git.

source: It may be helpful to think of your branches as silos.
es: Puede ayudar pensar en las ramas como silos de almacenamiento.

source: The problem is, you don’t want to do a commit of half-done work just so you can get back to this point later.
es: Esto plantea el problema de confirmar cambios en un trabajo medio hecho, simplemente para poder volver a ese punto más tarde.

source: You get a list of new commits being pushed to your server with `git rev-list`.
es: Con 'git rev-list', obtienes una lista de las nuevas confirmaciones de cambio enviadas a tu servidor.

source: ### Integrating Contributed Work ###
es: ### Integrando el trabajo aportado por otros ###

source: I used Ruby to write these, both because it’s my preferred scripting language and because I feel it’s the most pseudocode-looking of the scripting languages; thus you should be able to roughly follow the code even if you don’t use Ruby.
es: He usado Ruby para escribir los ejemplos, tanto porque es mi lenguaje preferido de scripting y porque creo que es el más parecido a pseudocódigo; de tal forma que puedas ser capaz de seguir el código, incluso si no conoces Ruby.

source: There are a few ways you can give access to everyone on your team.
es: Tienes varias maneras para dar acceso a todos los miembros de tu equipo.

source: Here we can see the two commits that we have had checked out, however there is not much information here.
es: Se pueden ver las dos confirmaciones de cambios que hemos activado, pero no hay mucha más información al respecto.

source: Gitosis is basically a set of scripts that help you manage the `authorized_keys` file as well as implement some simple access controls.
es: Gitosis es básicamente un conjunto de scripts que te ayudarán a gestionar el archivo 'authorized_keys', así como a implementar algunos controles de acceso simples.

source: If you add a remote and push to it, Git stores the value you last pushed to that remote for each branch in the `refs/remotes` directory.
es: Si añades un remoto y envias algo a él, Git almacenará en dicho remoto el último valor para cada rama presente en la carpeta `refs/remotes`.

source: Now that you have the contents of your key in Git, you can create a tag that points directly to it by specifying the new SHA-1 value that the `hash-object` command gave you:
es: Una vez tengas el contenido de tu clave guardado en Git, puedes crear una etiquta que apunte directamente al mismo; indicando para ello el nuevo valor SHA-1 que te ha devuelto el objeto 'hash-object':

source: It’s important to note that these commits are listed in the opposite order than you normally see them using the `log` command.
es: Es importante destacar que esas confirmaciones de cambios se han listado en el orden opuesto al que normalmente son mostradas en el comando `log`.

source: Again, this gives you normal `log` output but shows you only the commit information for those four commits, appearing in the traditional commit date ordering.
es: De nuevo, esto da una salida normal de 'log', pero mostrando tan solo información sobre las cuatro confirmaciones de cambio, dadas en la tradicional secuencia ordenada por fechas.

source: You’re ready to roll.
es: Y ya estás preparado para trabajar.

source: Insert 18333fig0515.png Figure 5-15.
es: Insert 18333fig0515.png Figura 5-15.

source: The end snapshot should be identical no matter which order she chooses; only the history will be slightly different.
es: La situación final (snapshot) será la misma, indistintamente del orden elegido; tan solo el historial variará ligeramente.

source: Git will move them for the sake of efficiency into a file named `.git/packed-refs` that looks like this:
es: En aras de la eficiencia, Git los moverá a un archivo denominado `.git/packed-refs`:

source: In the early days of Git (mostly pre 1.5), the user interface was much more complex because it emphasized this filesystem rather than a polished VCS.
es: En los primeros tiempos de Git (principalmente antes de la versión 1.5), el interface de usuario era mucho más complejo, ya que se centraba en el sistema de archivos en lugar de en el VCS.

source: This is the case because the pointer you have for the submodule isn’t what is actually in the submodule directory.
es: Siendo esto debido a que el puntero al submódulo que se tiene en este momento no corresponde a lo que realmente hay en carpeta del submódulo.

source: #### Enforcing Fast-Forward-Only Pushes ####
es: #### Obligando a realizar envios solo-de-avance-rapido (Fast-Forward-Only pushes) ####

source: Passing `-p` to it instructs the `cat-file` command to figure out the type of content and display it nicely for you:
es: Pasandole la opción '-p', puedes indicar al comando 'cat-file' que deduzca el tipo de contenido y te lo muestre adecuadamente:

source: In Git, however, every developer is potentially both a node and a hub — that is, every developer can both contribute code to other repositories and maintain a public repository on which others can base their work and which they can contribute to.
es: En Git, en cambio, cada desarrollador es potencialmente tanto un nodo como un repositorio --es decir, cada desarrollador puede tanto contribuir a otros repositorios, como servir de repositorio público sobre el que otros desarrolladores pueden basar su trabajo y contribuir a él--.

source: If you create an annotated tag, Git creates a tag object and then writes a reference to point to it rather than directly to the commit.
es: Al crear una etiqueta anotativa, Git crea un objeto tipo etiqueta y luego escribe una referencia apuntando a él en lugar de apuntar directamente a una confirmación de cambios.

source: The maintainer of the Git project tends to namespace these branches as well — such as `sc/ruby_client`, where `sc` is short for the person who contributed the work.
es: La persona gestora del proyecto Git suele tender a nombrar cada rama de foma parecida --por ejemplo 'sc/ruby client', donde sc es la abreviatura para la persona que ha contribuido con ese trabajo--.

source: The stable branches are farther down the line in your commit history, and the bleeding-edge branches are farther up the history (see Figure 3-18).
es: Las ramas estables apuntan hacia posiciones más antiguas en el registro de confirmaciones. Mientras que las ramas avanzadas, las que van abriendo camino, apuntan hacia posiciones más recientes.

source: Now, you can add content to Git and pull it back out again.
es: Ahora que sabes cómo añadir contenido a Git y cómo recuperarlo de vuelta.

source: Some Linux distributions have a `gitweb` package that you may be able to install via `apt` or `yum`, so you may want to try that first.
es: Algunas distribuciones Linux suelen incluir el paquete 'gitweb', y podrás instalarlo a través de las utilidades 'apt' o 'yum'; merece la pena probarlo en primer lugar.

source: Various integration managers are in charge of certain parts of the repository; they’re called lieutenants.
es: Unos gestores de integración se encargan de partes concretas del repositorio; y se denominan tenientes.

source: To create a branch and switch to it at the same time, you can run the `git checkout` command with the `-b` switch:
es: Para crear una nueva rama y saltar a ella, en un solo paso, puedes utilizar el comando 'git checkout' con la opción '-b':

source: You stage the changes you want by editing a file and running `git add` on it or `git rm` to a tracked file, and the subsequent `git commit --amend` takes your current staging area and makes it the snapshot for the new commit.
es: Se preparan en el área de preparación los archivos deseados; con los comandos `git add` o `git rm`, según corresponda. Y, a continuación, se lanza el comando `git commit --amend`. Este tendrá en cuenta dicha preparación para rehacer la instantánea de archivos en la nueva confirmación de cambios.

source: To do this, you can figure out which key you want by running `gpg --list-keys`:
es: Para ello, has de seleccionar cada clave que deseas incluir, lanzando el comando 'gpg ---list-keys':

source: If you’re making signed annotated tags (as discussed in Chapter 2), setting your GPG signing key as a configuration setting makes things easier.
es: Si tienes costumbre de firmar tus etiquetas (tal y como se ha visto en el capítulo 2), configurar tu clave de firma GPG puede facilitarte la labor.
